# Daniel Green
## 1027606
### Chapter 03 Exercises

In [1]:
import pandas as pd

## Problem 1
We want to look at data for the FAANG stocks (Facebook, Apple, Amazon, Netflix, and Google), but we were given each as a separate CSV file. Make them into a single file and store the dataframe of the FAANG data as `faang`:
1. Read each file in.
2. Add a column to each dataframe indicating the ticker it is for.  This is how you look up a stock.  In this case, the filename happens to be the ticker symbol
3. Append them together into a single dataframe.
4. Save the result to a faang.csv file.

In [14]:
faang = pd.DataFrame()
for ticker in ['fb', 'aapl', 'amzn', 'nflx', 'goog']:
    df = pd.read_csv(f'./exercises/{ticker}.csv')
    df.insert(0, 'ticker', ticker.upper())     # second requirement, add ticker for stock
    faang = faang.append(df)

faang.to_csv('faang.csv', index=False)
print(faang.head) # ugly display but data valid should use df.head()
faang.head()

<bound method NDFrame.head of     ticker        date         high          low         open        close  \
0       FB  2018-01-02   181.580002   177.550003   177.679993   181.419998
1       FB  2018-01-03   184.779999   181.330002   181.880005   184.669998
2       FB  2018-01-04   186.210007   184.100006   184.899994   184.330002
3       FB  2018-01-05   186.899994   184.929993   185.589996   186.850006
4       FB  2018-01-08   188.899994   186.330002   187.199997   188.279999
..     ...         ...          ...          ...          ...          ...
246   GOOG  2018-12-24  1003.539978   970.109985   973.900024   976.219971
247   GOOG  2018-12-26  1040.000000   983.000000   989.010010  1039.459961
248   GOOG  2018-12-27  1043.890015   997.000000  1017.150024  1043.880005
249   GOOG  2018-12-28  1055.560059  1033.099976  1049.619995  1037.079956
250   GOOG  2018-12-31  1052.699951  1023.590027  1050.959961  1035.609985

         volume
0    18151900.0
1    16886600.0
2    13880900.0
3    13574500.0
4    17994700.0
..          ...
246   1590300.0
247   2373300.0
248   2109800.0
249   1414800.0
250   1493300.0

[1255 rows x 7 columns]>

,ticker,date,high,low,open,close,volume
0,FB,2018-01-02,181.580002,177.550003,177.679993,181.419998,18151900.0
1,FB,2018-01-03,184.779999,181.330002,181.880005,184.669998,16886600.0
2,FB,2018-01-04,186.210007,184.100006,184.899994,184.330002,13880900.0
3,FB,2018-01-05,186.899994,184.929993,185.589996,186.850006,13574500.0
4,FB,2018-01-08,188.899994,186.330002,187.199997,188.279999,17994700.0

## Problem 2
With `faang`, use type conversion to change the `date` column to datetime and the `volume` column to integers. Then, sort by `date` and `ticker`.

In [15]:
faang = faang.assign(
    date=lambda x: pd.to_datetime(x.date), #functionname=lambda arguments : expression
    volume=lambda x: x.volume.astype(int)
).sort_values(
    ['date', 'ticker']
)

faang.head()

,ticker,date,high,low,open,close,volume
0,AAPL,2018-01-02,43.075001,42.314999,42.540001,43.064999,102223600
0,AMZN,2018-01-02,1190.000000,1170.510010,1172.000000,1189.010010,2694500
0,FB,2018-01-02,181.580002,177.550003,177.679993,181.419998,18151900
0,GOOG,2018-01-02,1066.939941,1045.229980,1048.339966,1065.000000,1237600
0,NFLX,2018-01-02,201.649994,195.419998,196.100006,201.070007,10966900

## Problem 3
Find the 7 rows with the lowest value for `volume`, using built in function.

In [16]:
faang.nsmallest(7, 'volume')

,ticker,date,high,low,open,close,volume
126,GOOG,2018-07-03,1135.819946,1100.020020,1135.819946,1102.890015,679000
226,GOOG,2018-11-23,1037.589966,1022.398987,1030.000000,1023.880005,691500
99,GOOG,2018-05-24,1080.469971,1066.150024,1079.000000,1079.239990,766800
130,GOOG,2018-07-10,1159.589966,1149.589966,1156.979980,1152.839966,798400
152,GOOG,2018-08-09,1255.541992,1246.010010,1249.900024,1249.099976,848600
159,GOOG,2018-08-20,1211.000000,1194.625977,1205.020020,1207.770020,870800
161,GOOG,2018-08-22,1211.839966,1199.000000,1200.000000,1207.329956,887400

## Problem 4
Right now, the data is somewhere between long and wide format. Use `melt()` to make it completely long format.
HINT: date and ticker are our ID variables (they uniquely identify each row).  We need to melt the rest so that we don't have separate columns for open, high, low, close, volume.

In [18]:
melted_faang = faang.melt(
    id_vars=['ticker', 'date'], 
    value_vars=['open', 'high', 'low', 'close', 'volume']
)
melted_faang.head()

  ticker       date variable        value
0   AAPL 2018-01-02     open    42.540001
1   AMZN 2018-01-02     open  1172.000000
2     FB 2018-01-02     open   177.679993
3   GOOG 2018-01-02     open  1048.339966
4   NFLX 2018-01-02     open   196.100006

## Exercise 5
Suppose we found out there was a glitch in how the data was recorded on July 26, 2018. How should we handle this?
__________________________________________________
A glitch in the data could happen by either analysis inconsistencies or misunderstanding the data.  With such a narrow scope with which to start it would be helpful to take a sample before and after that date/time stamp and see what happened during that time.  If the original data import confirms the data is accurate as imported from the source the next step is to look at outside influences to make sure the data was valid for that time period.  If the data is not valid then a data correction would be warranted with heavy documentation on both what was found and how it was corrected.

## Exercise 6
The European Centre for Disease Prevention and Control (ECDC) provides an open dataset on COVID-19 cases called, [*daily number of new reported cases of COVID-19 by country worldwide*](https://www.ecdc.europa.eu/en/publications-data/download-todays-data-geographic-distribution-covid-19-cases-worldwide). This dataset is updated daily, but we will use a snapshot that contains data from January 1, 2020 through September 18, 2020. Clean and pivot the data so that it is in wide format:

1. Read in the `covid19_cases.csv` file.
2. Create a `date` column using the data in the `dateRep` column and the `pd.to_datetime()` function.
3. Set the `date` column as the index and sort the index.
4. Replace occurrences of `United_States_of_America` and `United_Kingdom` with `USA` and `UK`, respectively.
5. Using the `countriesAndTerritories` column, filter the data down to Argentina, Brazil, China, Colombia, India, Italy, Mexico, Peru, Russia, Spain, Turkey, the UK, and the USA.
6. Pivot the data so that the index contains the dates, the columns contain the country names, and the values are the case counts in the `cases` column. Be sure to fill in `NaN` values with `0`.

In [2]:
import pandas as pd
covid = pd.read_csv('./exercises/covid19_cases.csv').assign( #step a
    date=lambda x: pd.to_datetime(x.dateRep, format='%d/%m/%Y') #step b
).set_index('date').replace( # why does this line start with a close parenthesis?
    'United_States_of_America', 'USA'
).replace('United_Kingdom', 'UK').sort_index()#step d

covid[
    covid.countriesAndTerritories.isin([
        'Argentina', 'Brazil', 'China', 'Colombia', 'India', 'Italy', 
        'Mexico', 'Peru', 'Russia', 'Spain', 'Turkey', 'UK', 'USA'
    ]) #step e
].reset_index().pivot(index='date', columns='countriesAndTerritories', values='cases').fillna(0) #step f

#This was difficult for me and I used the solution quite a bit.

countriesAndTerritories,Argentina,Brazil,China,Colombia,India,Italy,Mexico,Peru,Russia,Spain,Turkey,UK,USA
date,,,,,,,,,,,,,
2020-01-01,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-02,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-03,0.0,0.0,17.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-04,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2020-01-05,0.0,0.0,15.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2020-09-14,10778.0,14768.0,29.0,7355.0,92071.0,1456.0,4408.0,6787.0,5449.0,27404.0,1527.0,3330.0,33871.0
2020-09-15,9056.0,15155.0,22.0,5573.0,83809.0,1008.0,3335.0,4241.0,5509.0,9437.0,1716.0,2621.0,34841.0
2020-09-16,9908.0,36653.0,24.0,6698.0,90123.0,1229.0,4771.0,4160.0,5529.0,11193.0,1742.0,3103.0,51473.0
2020-09-17,11893.0,36820.0,7.0,7787.0,97894.0,1452.0,4444.0,6380.0,5670.0,11291.0,1771.0,3991.0,24598.0
2020-09-18,11674.0,36303.0,44.0,7568.0,96424.0,1583.0,3182.0,5698.0,5762.0,14389.0,1648.0,3395.0,43567.0